In [ ]:
import pandas as pd

In [ ]:
#Veri tipleri

In [ ]:
#series (1-boyutlu)

In [ ]:
carMake = pd.Series(["BMW", "Toyota", "Honda"])
carMake

In [ ]:
colours = pd.Series(["Red", "Blue", "White"])
colours

In [ ]:
#DataFrame (n-boyutlu)

In [ ]:
car_data = pd.DataFrame({"Car Make": carMake, "Colour": colours})
car_data

In [ ]:
#import data

In [ ]:
carSales = pd.read_csv("car-sales.csv")
carSales

In [ ]:
carSales["Colour"]

In [ ]:
carSales[["Make", "Colour", "Price"]]

In [ ]:
carSales.dtypes

In [ ]:
carSales.columns

In [ ]:
carSales.index

In [ ]:
carSales.describe()

In [ ]:
carSales["Odometer (KM)"].mean()

In [ ]:
carSales["Doors"].min()

In [ ]:
carSales["Odometer (KM)"].sum()

In [ ]:
carSales.info()

In [ ]:
carSales[carSales["Make"]=="Toyota"]

In [ ]:
carSales[carSales["Make"]=="Toyota"][["Colour", "Doors"]]

In [ ]:
pd.crosstab(carSales["Make"], carSales["Doors"])

In [ ]:
gcarSales = carSales.groupby(["Make"])
gcarSales["Doors"].mean()

In [ ]:
#export data

In [ ]:
fruits = pd.DataFrame({"Name":["elma", "armut", "karpuz", "muz"],"Colour":["Yeşil","Sarı", "Kırmızı", "Sarı"]})
fruits

In [ ]:
fruits.to_csv("my-fruits.csv")

In [ ]:
# Görselleştirme

In [ ]:
carSales["Odometer (KM)"].plot()

In [ ]:
carSales["Odometer (KM)"].hist()

In [ ]:
# veriyi manipule etme/ düzenleme

In [83]:
fruits

     Name   Colour
0    elma    Yeşil
1   armut     Sarı
2  karpuz  Kırmızı
3     muz     Sarı

In [84]:
fruits["Name"].str.capitalize()

0      Elma
1     Armut
2    Karpuz
3       Muz
Name: Name, dtype: object

In [85]:
fruits

     Name   Colour
0    elma    Yeşil
1   armut     Sarı
2  karpuz  Kırmızı
3     muz     Sarı

In [86]:
fruits["Name"] = fruits["Name"].str.capitalize()

In [87]:
fruits

     Name   Colour
0    Elma    Yeşil
1   Armut     Sarı
2  Karpuz  Kırmızı
3     Muz     Sarı

In [ ]:
# Sampling

In [89]:
carSales.sample(frac=0.3)

     Make Colour  Odometer (KM)  Doors       Price
3     BMW  Black          11179      5  $22,000.00
5  Toyota  Green          99213      4   $4,500.00
0  Toyota  White         150043      4   $4,000.00